driver-tests/smtpbc/SMTPBCTests/mailtoNosubNocontJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/triggerWSDL">
  <soapenv:Body>
    <trig:triggerWSDLOperation>
      <part1></part1>
    </trig:triggerWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>